app/views/qits/index.html.erb

  <br>
  <p style="color: green;">Asset Count: <%=Qit.count %></th></p>
---
SELECT "qits".* FROM "qits" WHERE (item_id LIKE '%VIDWATH%')  ORDER BY created_at DESC
SELECT COUNT(*) FROM "qits"