app/controllers/qits_controller.rb

  def index
    @qits = Qit.paginate(:page => params[:page])
---
SELECT  "qits".* FROM "qits" WHERE (item LIKE '%WINDOWS%')  ORDER BY created_at DESC LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "qits" WHERE (item LIKE '%WINDOWS%')

  def edit
    @qit = Qit.find params[:id]
---
SELECT  "qits".* FROM "qits" WHERE "qits"."id" = ? LIMIT 1  [["id", 2]]

  def update
    @qit = Qit.find(params[:id])
    if @qit.update_attributes(qit_params)
---
SELECT  "qits".* FROM "qits" WHERE "qits"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "qits" SET "item" = ?, "item_status" = ?, "issue" = ?, "returned_on" = ?, "updated_at" = ? WHERE "qits"."id" = ?  [["item", "moose"], ["item_status", "RETURNED"], ["issue", "kasad"], ["returned_on", "2016-09-19"], ["updated_at", "2016-09-19 08:05:17.291866"], ["id", 6]]

  def create
    @qit = Qit.new(qit_params)
    if @qit.save
---
INSERT INTO "qits" ("borrower_id", "borrower", "item", "item_id", "item_status", "incharge", "issue", "borrowed_on", "returned_on", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def destroy
    Qit.find( params[:id] ).destroy!
---
DELETE FROM "qits" WHERE "qits"."id" = ?  [["id", 1]]
SELECT  "qits".* FROM "qits" WHERE "qits"."id" = ? LIMIT 1  [["id", 1]]